czplove/zigbeeember573/platform/base/hal/micro/cortexm3/efm32/micro.c
// -----------------------------------------------------------------------------
// @file
// @brief EFM micro specific full HAL functions
//
// @author Silicon Laboratories Inc.
// @version 1.0.0
//
// @section License
// <b>(C) Copyright 2014 Silicon Laboratories, http://www.silabs.com</b>
//
// This file is licensed under the Silabs License Agreement. See the file
// "Silabs_License_Agreement.txt" for details. Before using this software for
// any purpose, you must agree to the terms of that agreement.
//
// -----------------------------------------------------------------------------
#include PLATFORM_HEADER
#include "em_device.h"
#include "em_chip.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_prs.h"
#include "rtcdriver.h"
#include "em_chip.h"
#include "gpiointerrupt.h"

#include "stack/include/ember.h"
#include "include/error.h"
#include "hal/hal.h"
#include "serial/serial.h"
#include "hal/micro/cortexm3/diagnostic.h"
#include "hal/micro/cortexm3/memmap.h"
#include "hal/micro/cortexm3/flash.h"

#ifdef _EFR_DEVICE
#include "graphics.h"
#include "pti.h"
#include "pa.h"
#include "tempdrv.h"
#include "sleep-efm32.h"
#endif

#ifdef BSP_STK
#include "bsp.h"
#endif

#ifdef RTOS
  #include "rtos/rtos.h"
#endif

static void halStackRadioHoldOffPowerDown(void); // fwd ref
static void halStackRadioHoldOffPowerUp(void);   // fwd ref

#ifdef PTA_REQ_MAX_BACKOFF_MASK
static void ptaReqRandomBackoff()
{
  halCommonDelayMicroseconds(halCommonGetRandom() & PTA_REQ_MAX_BACKOFF_MASK);
}
#else //PTA_REQ_MAX_BACKOFF_MASK
#define ptaReqRandomBackoff()
#endif //PTA_REQ_MAX_BACKOFF_MASK

#ifdef _EFR_DEVICE
bool halInternalGetCtuneToken(uint16_t *startupCtune, uint16_t *steadyCtune)
{
  tokTypeMfgCTune ctuneMfgTok=0xFFFF;
  halCommonGetToken(&ctuneMfgTok, TOKEN_MFG_CTUNE);
  if(ctuneMfgTok!=0xFFFF) {
    *startupCtune = ctuneMfgTok;
    *steadyCtune = ctuneMfgTok;
    return true;
  }
  return false;
}

void halInternalEnableHFXO(void)
{
  #ifndef EMBER_AF_USE_HWCONF
    CMU_HFXOInit_TypeDef hfxoInit = CMU_HFXOINIT_WSTK_DEFAULT;
  #else
    CMU_HFXOInit_TypeDef hfxoInit = CMU_HFXOINIT_DEFAULT;    
  #endif
  uint16_t customStartupCtune;
  uint16_t customSteadyCtune;
  if (halInternalGetCtuneToken(&customStartupCtune, &customSteadyCtune))
  {
    hfxoInit.ctuneStartup = customStartupCtune;
    hfxoInit.ctuneSteadyState = customSteadyCtune;    
  }
  CMU_HFXOInit(&hfxoInit);

  /* Enable HFXO oscillator, and wait for it to be stable */
  CMU_OscillatorEnable(cmuOsc_HFXO, true, true);

  /* Setting system HFXO frequency */
  SystemHFXOClockSet(38400000);

  /* Using HFXO as high frequency clock, HFCLK */
  CMU_ClockSelectSet(cmuClock_HF, cmuSelect_HFXO);

  /* HFRCO not needed when using HFXO */
  CMU_OscillatorEnable(cmuOsc_HFRCO, false, false);
}
#endif

// halInit is called on first initial boot, not on wakeup from sleep.
void halInit(void)
{
  /* Configure board. Select either EBI or SPI mode. */
#ifdef _EFR_DEVICE
  // HWCONF will handle clock initialization
  #ifndef EMBER_AF_USE_HWCONF
    CHIP_Init();
    halInternalEnableHFXO();
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFRCO);
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFRCO);
    CMU_ClockEnable(cmuClock_CORELE, true);
  #endif
  halInternalInitBoard();
  EMU_UnlatchPinRetention();
  RTCDRV_Init();
  TEMPDRV_Init();
 #ifndef DISABLE_WATCHDOG
  halInternalEnableWatchDog();
 #endif
  EMU_EM4Init_TypeDef em4Init = EMU_EM4INIT_DEFAULT;
  em4Init.em4State = emuEM4Hibernate;
  EMU_EM4Init(&em4Init);
  halInternalEm4Wakeup();
#elif defined(_EZR_DEVICE)
    CHIP_Init();
    halInternalInitButton();
    halInternalInitLed();
    halInternalInitRadioHoldOff();
    halInternalInitVCPPins();
    CMU_ClockSelectSet(cmuClock_HF, cmuSelect_HFXO);
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFRCO);
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFRCO);
    RTCDRV_Init();
    halInternalStartSymbolTimer();    // TODO: move to macInit or emRadioInit
#endif

  halInternalStartSystemTimer();
}

void halReboot(void)
{
  halInternalSysReset(RESET_SOFTWARE_REBOOT);
}

void halPowerDown(void)
{
  halInternalPowerDownBoard();
}

// halPowerUp is called from sleep state, not from first initial boot.
void halPowerUp(void)
{
  halInternalPowerUpBoard();
}

//If the board file defines runtime powerup/powerdown GPIO configuration,
//instantiate the variables and implement halStackRadioPowerDownBoard/
//halStackRadioPowerUpBoard which the stack will use to control the
//power state of radio specific GPIO.  If the board file does not define
//runtime GPIO configuration, the compile time configuration will work as
//it always has.
#ifdef DEFINE_SPI_CONFIG_VARIABLES
 DEFINE_SPI_CONFIG_VARIABLES();
#endif

// Instantiate global variables needed by the board header file
#ifdef DEFINE_BOARD_GPIO_CFG_VARIABLES
 DEFINE_BOARD_GPIO_CFG_VARIABLES();
#endif

void halStackRadioPowerDownBoard(void)
{
  (void) halPtaSetRxRequest(PTA_REQ_OFF, NULL);
  // Don't touch PTA Tx Request here
  halStackRadioHoldOffPowerDown();
}

void halStackRadioPowerUpBoard(void)
{
  halStackRadioHoldOffPowerUp();
}

void halStackRadioPowerMainControl(bool powerUp)
{
  if (powerUp) {
    halRadioPowerUpHandler();
  } else {
    halRadioPowerDownHandler();
  }
}

void halStackProcessBootCount(void)
{
  //Note: Because this always counts up at every boot (called from emberInit),
  //and non-volatile storage has a finite number of write cycles, this will
  //eventually stop working.  Disable this token call if non-volatile write
  //cycles need to be used sparingly.
#if defined(CREATOR_STACK_BOOT_COUNTER)
  halCommonIncrementCounterToken(TOKEN_STACK_BOOT_COUNTER);
#endif
}

PGM_P halGetResetString(void)
{
  // Table used to convert from reset types to reset strings.
  #define RESET_BASE_DEF(basename, value, string)  string,
  #define RESET_EXT_DEF(basename, extname, extvalue, string)  /*nothing*/
  static PGM char resetStringTable[][4] = {
    #include "reset-def.h"
  };
  #undef RESET_BASE_DEF
  #undef RESET_EXT_DEF

  return resetStringTable[halGetResetInfo()];
}

// Note that this API should be used in conjunction with halGetResetString
//  to get the full information, as this API does not provide a string for
//  the base reset type
PGM_P halGetExtendedResetString(void)
{

