czplove/zigbeeember573/platform/base/hal/micro/cortexm3/efm32/micro.c
  // Create a table of reset strings for each extended reset type
  typedef PGM char ResetStringTableType[][4];
  #define RESET_BASE_DEF(basename, value, string)   \
                         }; static ResetStringTableType basename##ResetStringTable = {
  #define RESET_EXT_DEF(basename, extname, extvalue, string)  string,
  {
    #include "reset-def.h"
  };
  #undef RESET_BASE_DEF
  #undef RESET_EXT_DEF

  // Create a table of pointers to each of the above tables
  #define RESET_BASE_DEF(basename, value, string)  (ResetStringTableType *)basename##ResetStringTable,
  #define RESET_EXT_DEF(basename, extname, extvalue, string)  /*nothing*/
  static ResetStringTableType * PGM extendedResetStringTablePtrs[] = {
    #include "reset-def.h"
  };
  #undef RESET_BASE_DEF
  #undef RESET_EXT_DEF

  uint16_t extResetInfo = halGetExtendedResetInfo();
  // access the particular table of extended strings we are interested in
  ResetStringTableType *extendedResetStringTable =
                    extendedResetStringTablePtrs[RESET_BASE_TYPE(extResetInfo)];

  // return the string from within the proper table
  return (*extendedResetStringTable)[((extResetInfo)&0xFF)];
}

// Translate EM3xx reset codes to the codes previously used by the EM2xx.
// If there is no corresponding code, return the EM3xx base code with bit 7 set.
uint8_t halGetEm2xxResetInfo(void)
{
  uint8_t reset = halGetResetInfo();

  // Any reset with an extended value field of zero is considered an unknown
  // reset, except for FIB resets.
  if ( (RESET_EXTENDED_FIELD(halGetExtendedResetInfo()) == 0) &&
       (reset != RESET_FIB) ) {
     return EM2XX_RESET_UNKNOWN;
  }

 switch (reset) {
  case RESET_UNKNOWN:
    return EM2XX_RESET_UNKNOWN;
  case RESET_BOOTLOADER:
    return EM2XX_RESET_BOOTLOADER;
  case RESET_EXTERNAL:      // map pin resets to poweron for EM2xx compatibility
//    return EM2XX_RESET_EXTERNAL;
  case RESET_POWERON:
    return EM2XX_RESET_POWERON;
  case RESET_WATCHDOG:
    return EM2XX_RESET_WATCHDOG;
  case RESET_SOFTWARE:
    return EM2XX_RESET_SOFTWARE;
  case RESET_CRASH:
    return EM2XX_RESET_ASSERT;
  default:
    return (reset | 0x80);      // set B7 for all other reset codes
  }
}

  // halPta Implementation:

  // Board header is expected to define:
  // PTA REQUEST signal (OUT or OUT_OD): [optional]
  // #define PTA_REQ_GPIO       // PORTx_PIN(y) (x=A/B/C/D/E/F/..., y=0-15)
  // #define PTA_REQ_GPIOCFG_NORMAL // gpioModePushPull
  // #define PTA_REQ_GPIOCFG_SHARED // gpioModeWiredAnd/Or
  // #define PTA_REQ_GPIOCFG    // PTA_REQ_GPIOCFG_NORMAL or _SHARED as above
  // #define PTA_REQ_ASSERTED   // 0 if negated logic; 1 if positive logic
  //
  // PTA GRANT signal (IN): [optional]
  // #define PTA_GNT_GPIO       // PORTx_PIN(y) (x=A/B/C/D/E/F/..., y=0-15)
  // #define PTA_GNT_GPIOCFG    // gpioModeInputPull[ASSERTED] or gpioModeInput
  // #define PTA_GNT_ASSERTED   // 0 if negated logic; 1 if positive logic
  // Note that REQ and GNT can share the same IRQn if necessary
  //
  // PTA PRIORITY signal (OUT): [optional]
  // #define PTA_PRI_GPIO       // PORTx_PIN(y) (x=A/B/C/D/E/F/..., y=0-15)
  // #define PTA_PRI_GPIOCFG    // gpioModePushPull or gpioModeWiredOr/And if shared
  // #define PTA_PRI_ASSERTED   // 0 if negated logic; 1 if positive logic

 #ifdef  PTA_REQ_GPIO

  static bool ptaReqAsserted = PTA_REQ_ASSERTED;

  static inline void ptaReqGpioSet(bool enable)
  {
    if (enable == ptaReqAsserted) {
      halGpioSet(PTA_REQ_GPIO);
    } else {
      halGpioClear(PTA_REQ_GPIO);
    }
  }

  static inline void ptaReqGpioCfg(void)
  {
    // Only configure GPIO if it was not set up prior
    if (halGpioGetConfig(PTA_REQ_GPIO) == gpioModeDisabled)
    {
     #if     PTA_REQ_ASSERTED
      halGpioClear(PTA_REQ_GPIO);
     #else//!PTA_REQ_ASSERTED
      halGpioSet(PTA_REQ_GPIO);
     #endif//PTA_REQ_ASSERTED
      halGpioSetConfig(PTA_REQ_GPIO, PTA_REQ_GPIOCFG);
    }
    // Here we sense asserted state is opposite of its current output state.
    ptaReqAsserted = !halGpioReadOutput(PTA_REQ_GPIO);
  }

  #define ptaReqGpioCfgIsShared() \
            (halGpioGetConfig(PTA_REQ_GPIO) != PTA_REQ_GPIOCFG_NORMAL)

  #define ptaReqGpioInAsserted() \
            (!!halGpioRead(PTA_REQ_GPIO) == !!ptaReqAsserted)

  #define ptaReqGpioOutAsserted() \
            (!!halGpioReadOutput(PTA_REQ_GPIO) == !!ptaReqAsserted)

  #define ptaReqAndGntIrqShared() \
            ( (defined(PTA_GNT_GPIO))                          /*Have GNT*/ \
            &&(GPIO_PIN(PTA_REQ_GPIO) == GPIO_PIN(PTA_GNT_GPIO)) )/*Shared IRQ*/

 #if     (ptaReqAndGntIrqShared())
  #define PTA_REQ_ISR PTA_GNT_ISR // REQUEST and GRANT share same IRQ & ISR
 #endif//(ptaReqAndGntIrqShared())

  static void PTA_REQ_ISR(uint8_t pin);

  static inline void ptaReqGpioIntAcknowledge(void)
  {
    GPIO_IntClear(GPIO_FLAG(PTA_REQ_GPIO));
  }

  static inline void ptaReqGpioIntDisable(void)
  {
    GPIO_IntDisable(GPIO_FLAG(PTA_REQ_GPIO));
    ptaReqGpioIntAcknowledge();
  }

  static inline void ptaReqGpioIntEnable(void)
  {
    // Disable triggering and clear any stale events
    GPIO_IntConfig(GPIO_PORT(PTA_REQ_GPIO), GPIO_PIN(PTA_REQ_GPIO),
                   false, false, false);
    // Register callback before setting up and enabling pin interrupt
    GPIOINT_CallbackRegister(GPIO_PIN(PTA_REQ_GPIO), PTA_REQ_ISR);
    // Enable deasserting edge interrupt only
    GPIO_IntConfig(GPIO_PORT(PTA_REQ_GPIO), GPIO_PIN(PTA_REQ_GPIO),
                   !ptaReqAsserted, ptaReqAsserted, true);
  }

 #else//!PTA_REQ_GPIO

  #define ptaReqGpioSet(enable)      /* no-op */
  #define ptaReqGpioCfg()            /* no-op */
  #define ptaReqGpioCfgIsShared()    0
  #define ptaReqGpioInAsserted()     0
  #define ptaReqGpioIntAcknowledge() /* no-op */
  #define ptaReqGpioIntDisable()     /* no-op */
  #define ptaReqGpioIntEnable()      /* no-op */
  #define ptaReqGpioOutAsserted()    1
  #define ptaReqAndGntIrqShared()    0

 #endif//PTA_REQ_GPIO

 #ifdef  PTA_GNT_GPIO

  static void PTA_GNT_ISR(uint8_t pin);

  static bool ptaGntAsserted = PTA_GNT_ASSERTED;
  static bool gntWasAsserted = false;

  static inline void ptaGntGpioCfg(void)
  {
    // Only configure GPIO if it was not set up prior
    if (halGpioGetConfig(PTA_GNT_GPIO) == gpioModeDisabled)
    {
     #if     PTA_GNT_ASSERTED
      halGpioSet(PTA_GNT_GPIO); // pull up
     #else//!PTA_GNT_ASSERTED
      halGpioClear(PTA_GNT_GPIO); // pull down
     #endif//PTA_GNT_ASSERTED
      halGpioSetConfig(PTA_GNT_GPIO, PTA_GNT_GPIOCFG);
    }
    // Here we sense asserted state is same as its current output state.
    ptaGntAsserted = !!halGpioReadOutput(PTA_GNT_GPIO);
  }

  #define ptaGntGpioInAsserted() \
            (!!halGpioRead(PTA_GNT_GPIO) == !!ptaGntAsserted)

  static inline void ptaGntGpioIntAcknowledge(void)
  {
    GPIO_IntClear(GPIO_FLAG(PTA_GNT_GPIO));
  }

  static inline void ptaGntGpioIntDisable(void)
  {
    GPIO_IntDisable(GPIO_FLAG(PTA_GNT_GPIO));
    ptaGntGpioIntAcknowledge();
  }

