czplove/zigbeeember573/platform/base/hal/micro/cortexm3/efm32/micro.c
  static inline void ptaGntGpioIntEnable(void)
  {
    // Disable triggering and clear any stale events
    GPIO_IntConfig(GPIO_PORT(PTA_GNT_GPIO), GPIO_PIN(PTA_GNT_GPIO),
                   false, false, false);
    gntWasAsserted = false; // Ensures we won't miss GNT assertion
    // Register callbacks before setting up and enabling pin interrupt
    GPIOINT_CallbackRegister(GPIO_PIN(PTA_GNT_GPIO), PTA_GNT_ISR);
    // Enable both edges' interrupt
    GPIO_IntConfig(GPIO_PORT(PTA_GNT_GPIO), GPIO_PIN(PTA_GNT_GPIO),
                   true, true, true);
  }

  static inline void ptaGntGpioIntPend(void)
  {
    GPIO_IntSet(GPIO_FLAG(PTA_GNT_GPIO));
  }

 #else//!PTA_GNT_GPIO

  #define ptaGntGpioCfg()            /* no-op */
  #define ptaGntGpioInAsserted()     1
  #define ptaGntGpioIntAcknowledge() /* no-op */
  #define ptaReqGpioIntDisable()     /* no-op */
  #define ptaGntGpioIntDisable()     /* no-op */
  #define ptaGntGpioIntEnable()      /* no-op */
  #define ptaGntGpioIntPend()        (halInternalPtaOrRhoNotifyRadio())

 #endif//PTA_GNT_GPIO

 #ifdef  PTA_PRI_GPIO

  static bool ptaPriAsserted = PTA_PRI_ASSERTED;

  static inline void ptaPriGpioSet(bool enable)
  {
    if (enable != ptaPriAsserted) {
      halGpioClear(PTA_PRI_GPIO);
    } else {
      halGpioSet(PTA_PRI_GPIO);
    }
  }

  static inline void ptaPriGpioCfg(void)
  {
    // Only configure GPIO if it was not set up prior
    if (halGpioGetConfig(PTA_PRI_GPIO) == gpioModeDisabled)
    {
     #if     PTA_PRI_ASSERTED
      halGpioClear(PTA_PRI_GPIO);
     #else//!PTA_PRI_ASSERTED
      halGpioSet(PTA_PRI_GPIO);
     #endif//PTA_PRI_ASSERTED
      halGpioSetConfig(PTA_PRI_GPIO, PTA_PRI_GPIOCFG);
    }
    // Here we sense asserted state is opposite of its current output state.
    ptaPriAsserted = !halGpioReadOutput(PTA_PRI_GPIO);
  }

 #else//!PTA_PRI_GPIO

  #define ptaPriGpioSet(enable)      /* no-op */
  #define ptaPriGpioCfg()            /* no-op */

 #endif//PTA_PRI_GPIO

  static void halInternalPtaOrRhoNotifyRadio(void);
  static volatile bool ptaEnabled;
  static volatile halPtaReq_t txReq, rxReq;
  static volatile halPtaCb_t  txCb,  rxCb;

  // Must be called with interrupts disabled
  static void ptaUpdateReqIsr(void)
  {
    halPtaReq_t txReqL = txReq; // Local non-volatile flavor avoids warnings
    halPtaReq_t rxReqL = rxReq; // Local non-volatile flavor avoids warnings
    bool myReq = !!((txReqL | rxReqL) & PTA_REQ_ON);     // I need to REQUEST
    bool force = !!((txReqL | rxReqL) & PTA_REQ_FORCE);  // (ignoring others)
    bool exReq;                                          // external requestor?
    if (ptaReqGpioOutAsserted()) {  // in GRANT phase
      exReq = false;                // ignore external requestors
    } else {                        // in REQUEST phase
      ptaReqGpioIntAcknowledge();   // Before sampling REQUEST, avoids race
      exReq = ptaReqGpioCfgIsShared() && ptaReqGpioInAsserted();
    }
    if (myReq) {                    // want to assert REQUEST
      if (force || !exReq) {        // can assert REQUEST
        ptaGntGpioIntAcknowledge();
        ptaGntGpioIntEnable();
        ptaReqGpioSet(true);
        ptaPriGpioSet(!!((txReqL | rxReqL) & PTA_REQ_HIPRI));

        // Issue callbacks on REQUEST assertion
        // These are one-shot callbacks
        if ((rxCb != NULL) && (rxReq & PTA_REQCB_REQUESTED)) {
          (*rxCb)(PTA_REQCB_REQUESTED);
          rxReq &= ~PTA_REQCB_REQUESTED;
        }
        if ((txCb != NULL) && (txReq & PTA_REQCB_REQUESTED)) {
          (*txCb)(PTA_REQCB_REQUESTED);
          txReq &= ~PTA_REQCB_REQUESTED;
        }
        ptaGntGpioIntPend(); // Manually force GRANT check if missed/no edge
      } else {                      // must wait for REQUEST
        ptaReqGpioIntEnable();
      }
    } else {                        // negate REQUEST
      ptaPriGpioSet(false);
      ptaReqGpioSet(false);
      ptaGntGpioIntDisable();
      ptaReqGpioIntDisable();
      halInternalPtaOrRhoNotifyRadio(); // Reassess (assert) RHO
    }
  }

 #ifdef  PTA_GNT_GPIO
  // Triggered on both GRANT edges
  static void PTA_GNT_ISR(uint8_t pin)
  {
    ptaGntGpioIntAcknowledge();
    if (ptaReqGpioOutAsserted()) {  // GRANT phase
      bool newGnt = ptaGntGpioInAsserted(); // Sample GPIO once, now
      if (newGnt != gntWasAsserted) {
        gntWasAsserted = newGnt;
        halInternalPtaOrRhoNotifyRadio();
        // Issue callbacks on GRANT assert or negate
        // These are not one-shot callbacks
        halPtaReq_t newState = (newGnt ? PTA_REQCB_GRANTED : PTA_REQCB_NEGATED);
        if ((rxCb != NULL) && (rxReq & newState)) {
          (*rxCb)(newState);
        }
        if ((txCb != NULL) && (txReq & newState)) {
          (*txCb)(newState);
        }
        // Do we need this to meet GRANT -> REQUEST timing?
        // On GNT deassertion, pulse REQUEST to keep us going.
        // Don't want to revert to REQUEST phase here but stay in GRANT phase.
        // This seems dangerous in that it could allow a peer to assert their
        // REQUEST causing a conflict/race.
       #ifdef ENABLE_PTA_REQ_PULSE
        if (!newGnt) {
          ptaReqGpioSet(false);
          ptaReqGpioSet(true);
        }
       #endif
      }
    } else {                        // REQUEST phase
     #if     (ptaReqAndGntIrqShared())
      if (ptaReqGpioCfgIsShared()) {
        // External REQUEST deasserted so we can assert ours
        ptaReqGpioIntDisable(); // This is a one-shot event
        //TODO: Perform some random backoff before claiming REQUEST??
        ptaReqRandomBackoff();
        ptaUpdateReqIsr();
      } else {
        // Ignore GRANT changes unless we are REQUESTing
      }
     #endif//(ptaReqAndGntIrqShared())
    }
  }
 #endif//PTA_GNT_GPIO

 #if     ( defined(PTA_REQ_GPIO) && (!ptaReqAndGntIrqShared()) )
  // This IRQ is triggered on the negate REQUEST edge,
  // needed only when REQUEST signal is shared,
  // and not piggybacking GNT and REQ on same IRQ.
  static void PTA_REQ_ISR(uint8_t pin)
  {
    // External REQUEST deasserted so we can assert ours
    //ptaReqGpioIntAcknowledge(); // Covered within ptaReqGpioIntDisable()
    ptaReqGpioIntDisable(); // This is a one-shot event
    //TODO: Perform some random backoff before claiming REQUEST??
    ptaReqRandomBackoff();
    ptaUpdateReqIsr();
  }
 #endif//( defined(PTA_REQ_GPIO) && (!ptaReqAndGntIrqShared()) )

  // Public API

 #ifndef EM_PTA_MAC_RETRANSMIT_TOGGLE_REQ
 #define EM_PTA_MAC_RETRANSMIT_TOGGLE_REQ 0 // default no toggle on retransmit
 #endif//EM_PTA_MAC_RETRANSMIT_TOGGLE_REQ

  bool halPtaToggleReqOnMacRetransmit = EM_PTA_MAC_RETRANSMIT_TOGGLE_REQ;

  EmberStatus halPtaSetTxRequest(halPtaReq_t ptaReq, halPtaCb_t ptaCb)
  {
    EmberStatus status = EMBER_ERR_FATAL;
    ATOMIC(
      if (ptaEnabled) {
        // Signal old OFF callback when unrequesting
        // in case PTA is disabled whilst in the midst of a request,
        // so the requestor's state machine doesn't lock up.
        if ( (ptaReq == PTA_REQ_OFF)
           &&(txReq != PTA_REQ_OFF)
           &&(txCb != NULL)
           &&(txReq & PTA_REQCB_OFF) ) {
            (*txCb)(PTA_REQCB_OFF);
        }
        txCb  = ptaCb;
        if (txReq == ptaReq) {
          // Save a little time if redundant request
        } else {
          txReq = ptaReq;
          ptaUpdateReqIsr();
        }
        status = EMBER_SUCCESS;
      }
    )//ATOMIC
    return status;
  }

  EmberStatus halPtaSetRxRequest(halPtaReq_t ptaReq, halPtaCb_t ptaCb)
  {
    EmberStatus status = EMBER_ERR_FATAL;
    ATOMIC(
      if (ptaEnabled) {
        // Signal old OFF callback when unrequesting
        // in case PTA is disabled whilst in the midst of a request,
        // so the requestor's state machine doesn't lock up.
        if ( (ptaReq == PTA_REQ_OFF)
           &&(rxReq != PTA_REQ_OFF)
           &&(rxCb != NULL)
           &&(rxReq & PTA_REQCB_OFF) ) {
            (*rxCb)(PTA_REQCB_OFF);
        }
        rxCb  = ptaCb;
        if (rxReq == ptaReq) {
          // Save a little time if redundant request
        } else {
          rxReq = ptaReq;
          ptaUpdateReqIsr();
        }
        status = EMBER_SUCCESS;
      }
    )//ATOMIC
    return status;
  }

  // Certain radios may want to override this with their own
  WEAK(void emRadioEnablePta(bool enable))
  {
  }

  EmberStatus halPtaSetEnable(bool enabled)
  {
    if (enabled) {
      ptaReqGpioCfg();
      ptaPriGpioCfg();
      ptaGntGpioCfg();
    } else {
      // Shut any pending PTA operation down
      (void) halPtaSetRxRequest(PTA_REQ_OFF, NULL);
      (void) halPtaSetTxRequest(PTA_REQ_OFF, NULL);
    }
    ptaEnabled = enabled;
    // Inform the radio in case PTA requires radio state manipulations
    emRadioEnablePta(enabled);
    halInternalPtaOrRhoNotifyRadio(); //Notify Radio land of new config
    return EMBER_SUCCESS;
  }

  bool halPtaIsEnabled(void)
  {
    return ptaEnabled;
  }

#ifdef  RHO_GPIO // BOARD_HEADER supports Radio HoldOff

