czplove/zigbeeember573/platform/base/hal/micro/cortexm3/efm32/micro.c
#define RHO_ENABLED_MASK  0x01u // RHO is enabled
#define RHO_RADIO_ON_MASK 0x02u // Radio is on (not sleeping)
static uint8_t rhoState;
static bool rhoAsserted = !!RHO_ASSERTED;

bool halGetRadioHoldOff(void)
{
  return (!!(rhoState & RHO_ENABLED_MASK));
}

// Return active state of Radio HoldOff GPIO pin
static bool halInternalRhoPinIsActive(void)
{
  return ( (rhoState & RHO_ENABLED_MASK)
         &&(((bool)halGpioRead(RHO_GPIO)) == rhoAsserted) );
}

#if defined(PTA_REQ_PULSE_ON_RHO_DEASSERT) && defined(PTA_GNT_GPIO) && defined(PTA_REQ_GPIO)
static void halInternalTogglePtaReq()
{
  if( ptaEnabled                      // PTA is enabled and
      && ptaReqGpioOutAsserted()      // REQUESTing and
      && !halInternalRhoPinIsActive() // RHO not asserted
      && !ptaGntGpioInAsserted()) {   // GRANT not asserted
    ptaReqGpioSet(false);
    ptaReqGpioSet(true);
 }
}
#else //defined(PTA_REQ_PULSE_ON_RHO_DEASSERT) && defined(PTA_GNT_GPIO) && defined(PTA_REQ_GPIO)
#define halInternalTogglePtaReq()
#endif //defined(PTA_REQ_PULSE_ON_RHO_DEASSERT) && defined(PTA_GNT_GPIO) && defined(PTA_REQ_GPIO)

static void RHO_ISR(uint8_t pin)
{
  // Ack interrupt before reading GPIO to avoid potential of missing int
  GPIO_IntClear(GPIO_FLAG(RHO_GPIO));
  if (rhoState & RHO_ENABLED_MASK) {
    // Notify Radio land of state change
    halInternalTogglePtaReq();
    halInternalPtaOrRhoNotifyRadio();
  }
}

EmberStatus halSetRadioHoldOff(bool enabled)
{
  // If enabling afresh or disabling after having been enabled
  // restart from a fresh state just in case.
  if (enabled || (rhoState & RHO_ENABLED_MASK)) {
    // Disable RHO interrupt & callback
    GPIO_IntConfig(GPIO_PORT(RHO_GPIO), GPIO_PIN(RHO_GPIO),
                   false, false, false);
    GPIOINT_CallbackUnRegister(GPIO_PIN(RHO_GPIO));
  }

  rhoState = (rhoState & ~RHO_ENABLED_MASK) | (enabled ? RHO_ENABLED_MASK : 0);

  if (enabled) {
    // Only configure GPIO if it was not set up prior
    if (halGpioGetConfig(RHO_GPIO) == gpioModeDisabled) {
      // Configure GPIO as input and if pulling, pull it toward deasserted state
      GPIO_PinModeSet(GPIO_PORT(RHO_GPIO), GPIO_PIN(RHO_GPIO),
                      RHO_GPIOCFG, !RHO_ASSERTED);
    }
    // Here we sense asserted state is opposite of its current output state.
    rhoAsserted = !halGpioReadOutput(RHO_GPIO);
    // Register callbacks before setting up and enabling pin interrupt.
    GPIOINT_CallbackRegister(GPIO_PIN(RHO_GPIO), RHO_ISR);
    // Set rising and falling edge interrupts; don't enable interrupt yet
    GPIO_IntConfig(GPIO_PORT(RHO_GPIO), GPIO_PIN(RHO_GPIO),
                   true, true, false);

    // Only update radio if it's on, otherwise defer to when it gets turned on
    if (rhoState & RHO_RADIO_ON_MASK) {
      halInternalPtaOrRhoNotifyRadio(); //Notify Radio land of current state
      GPIO_IntEnable(GPIO_FLAG(RHO_GPIO));
      // Interrupt on now, ISR will maintain proper state
    }
  } else {
    halInternalPtaOrRhoNotifyRadio(); //Notify Radio land of configured state
    // Leave interrupt state untouched (probably turned off above)
  }
  return EMBER_SUCCESS;
}

static void halStackRadioHoldOffPowerDown(void)
{
  rhoState &= ~RHO_RADIO_ON_MASK;
  if (rhoState & RHO_ENABLED_MASK) {
    // When sleeping radio, no need to monitor RHO anymore
    GPIO_IntDisable(GPIO_FLAG(RHO_GPIO)); //clear RHO top level int enable
  }
}

static void halStackRadioHoldOffPowerUp(void)
{
  rhoState |= RHO_RADIO_ON_MASK;
  if (rhoState & RHO_ENABLED_MASK) {
    // When waking radio, set up initial state and resume monitoring
    GPIO_IntDisable(GPIO_FLAG(RHO_GPIO)); //ensure RHO interrupt is off
    RHO_ISR(0); // Manually call ISR to assess current state
    GPIO_IntEnable(GPIO_FLAG(RHO_GPIO)); //enable RHO interrupt
  }
}

#else//!RHO_GPIO

// Stubs in case someone insists on referencing them or for PTA w/o RHO

bool halGetRadioHoldOff(void)
{
  return false;
}

EmberStatus halSetRadioHoldOff(bool enabled)
{
  return (enabled ? EMBER_BAD_ARGUMENT : EMBER_SUCCESS);
}

static void halStackRadioHoldOffPowerDown(void)
{
}

static void halStackRadioHoldOffPowerUp(void)
{
  halInternalPtaOrRhoNotifyRadio();
}

#define halInternalRhoPinIsActive() (false)

#endif//RHO_GPIO // Board header supports Radio HoldOff

extern void emRadioHoldOffIsr(bool active);

static void halInternalPtaOrRhoNotifyRadio(void)
{
  bool ptaRho = ( ptaEnabled                       // PTA is enabled and:
                &&( (!ptaReqGpioOutAsserted())     // not REQUESTing or
                  ||(!ptaGntGpioInAsserted()) ) ); // REQUEST not GRANTed
  emRadioHoldOffIsr(ptaRho || halInternalRhoPinIsActive());
}
